Repository: adimov-eth/og_xln
Catalog: frontend/ios/App/App/Localizable.xcstrings
Source language: en
Languages: ru

source: Home
ru: Главная

source: Activity
ru: История

source: Manage
ru: Счета

source: Settings
ru: Настройки

source: Wallet needs attention
ru: Проверьте кошелёк

source: OK
ru: ОК

source: Money, without borders.
ru: Деньги без границ.

source: A wallet that belongs to you. Send, receive and exchange with xln.
ru: Ваш кошелёк — в ваших руках. Платите, получайте и меняйте с xln.

source: Opening wallet…
ru: Открываем кошелёк…

source: Open my wallet
ru: Открыть кошелёк

source: Keys stay in your iPhone’s Keychain.
ru: Ключи хранятся в защищённой связке ключей iPhone.

source: No activity yet
ru: Пока нет операций

source: Your confirmed payments and swaps appear here.
ru: Здесь появятся подтверждённые платежи и обмены.

source: Connections
ru: Подключения

source: Confirmed frame
ru: Подтверждённый кадр

source: Disputed
ru: Спор

source: Confirming
ru: Подтверждается

source: Connected
ru: Подключён

source: Available ≈ %@
ru: Доступно ≈ %@

source: ASSETS
ru: АКТИВЫ

source: Your wallet is ready. Add funds to get started.
ru: Кошелёк готов. Пополните его для начала.

source: Try it with test money
ru: Попробуйте с тестовыми деньгами

source: 100 USDC · no real value
ru: 100 USDC · без реальной стоимости

source: CONNECTED TO XLN
ru: ПОДКЛЮЧЕНИЕ К XLN

source: Wallet settings
ru: Настройки кошелька

source: Send
ru: Отправить

source: Receive
ru: Получить

source: Swap
ru: Обменять

source: Wallet
ru: Кошелёк

source: Network
ru: Сеть

source: Share wallet address
ru: Поделиться адресом

source: Security
ru: Безопасность

source: Keys stored on this iPhone
ru: Ключи хранятся на этом iPhone

source: Lock wallet
ru: Заблокировать кошелёк

source: xln · native for iPhone
ru: xln · создан для iPhone

source: Verification
ru: Проверка

source: Export test evidence
ru: Выгрузить результаты проверки

source: Verification evidence exported
ru: Результаты проверки выгружены

source: Close
ru: Закрыть

source: Done
ru: Готово

source: Your xln address
ru: Ваш адрес xln

source: Share address
ru: Поделиться адресом

source: QR code for your xln address
ru: QR-код вашего адреса xln

source: QR code unavailable. Share the address below.
ru: QR-код недоступен. Поделитесь адресом ниже.

source: Maximum payment
ru: Максимальное списание

source: You pay
ru: Вы отдаёте

source: Minimum received
ru: Получите не меньше

source: They receive
ru: Получателю

source: Maximum fee
ru: Комиссия не более

source: To
ru: Кому

source: Incoming capacity
ru: Возможность получения

source: Your hub needs capacity to deliver this asset. Test credit allows the hub to owe you tokens without collateral.
ru: Для получения актива нужен лимит. Тестовый кредит разрешает хабу быть должным вам токены без обеспечения.

source: Allow unsecured test credit
ru: Разрешить тестовый кредит без обеспечения

source: Prepare receiving capacity
ru: Подготовить получение

source: Edit details
ru: Изменить данные

source: Test money
ru: Тестовые деньги

source: Test money · no real value
ru: Тестовые деньги · без реальной стоимости

source: This action can increase the amount your hub owes you without collateral.
ru: Это действие может увеличить сумму, которую хаб должен вам без обеспечения.

source: Get 100 test USDC
ru: Получить 100 тестовых USDC

source: 100 test USDC received
ru: Получено 100 тестовых USDC

source: Recipient
ru: Получатель

source: xln address
ru: Адрес xln

source: Asset
ru: Актив

source: A live price with fees shown before you confirm.
ru: Актуальная цена и комиссия — до подтверждения.

source: Review send
ru: Проверить платёж

source: Review swap
ru: Проверить обмен

source: Review payment
ru: Проверить платёж

source: Confirm send
ru: Подтвердить платёж

source: Confirm swap
ru: Подтвердить обмен

source: Activity shows confirmed payments and completed swap fills.
ru: Подтверждённые платежи и исполненные обмены отображаются в истории.

source: Payment submitted. Waiting for the confirmed receipt.
ru: Платёж отправлен. Ожидаем подтверждённую квитанцию.

source: Order placed. Track its fill in Activity.
ru: Заявка размещена. Исполнение — в истории.

source: Instant · amounts shown are maximum debit and fee
ru: Мгновенный платёж · показаны верхние границы списания и комиссии

source: Limit order · may close unfilled if price or liquidity changes
ru: Лимитная заявка · может закрыться без обмена при изменении цены или ликвидности

source: Preparing your wallet
ru: Подготавливаем кошелёк

source: Your keys. Your money.
ru: Ваши ключи. Ваши деньги.

source: Checking your wallet…
ru: Проверяем кошелёк…

source: Starting your runtime
ru: Запускаем кошелёк

source: Connecting to the network
ru: Подключаемся к сети

source: Syncing with the chain
ru: Проверяем историю сети

source: Publishing your profile
ru: Публикуем профиль

source: Ready
ru: Готово

source: Preparing…
ru: Подготавливаем…

source: Receiving…
ru: Получаем…

source: Payment confirmed
ru: Платёж подтверждён

source: My wallet
ru: Мой кошелёк

source: Sent
ru: Отправлено

source: Received
ru: Получено

source: Swap placed
ru: Заявка на обмен

source: Swap closed
ru: Обмен не исполнен

source: Swap filled
ru: Обмен исполнен

source: Account opened
ru: Счёт открыт

# settled
source: Confirmed
ru: Подтверждено

source: in flight
ru: в пути

source: placed
ru: размещена

source: closed
ru: закрыта

source: filled
ru: исполнена

source: Created
ru: Создано

source: failed
ru: ошибка

source: pending
ru: ожидание

source: Open your xln wallet
ru: Откройте кошелёк xln

source: Wallet unlock was cancelled.
ru: Открытие кошелька отменено.

source: Enter amount.
ru: Введите сумму.

source: Amount must be greater than zero.
ru: Сумма должна быть больше нуля.

source: Choose another valid xln wallet.
ru: Выберите другой действительный адрес xln.

source: Choose an available asset.
ru: Выберите доступный актив.

source: No funded route is available. Check the recipient and available balance.
ru: Маршрут с достаточным балансом не найден. Проверьте получателя и доступную сумму.

source: Waiting for a fresh market price.
ru: Ожидаем актуальную рыночную цену.

source: There is no liquidity for this swap.
ru: Для этого обмена сейчас нет ликвидности.

source: This amount exceeds the best available price. Try a smaller swap.
ru: Объём по лучшей цене недостаточен. Уменьшите сумму обмена.

source: Amount is below the market minimum.
ru: Сумма меньше минимального объёма рынка.

source: Connect a hub before swapping.
ru: Для обмена подключитесь к хабу.

source: Quote expired. Review a fresh quote before continuing.
ru: Срок котировки истёк. Проверьте новую котировку.

source: The xln network is unavailable. Your wallet remains on this iPhone.
ru: Сеть xln недоступна. Кошелёк остаётся на этом iPhone.

source: An operation is already in progress.
ru: Операция уже выполняется.

source: Wallet is still synchronizing.
ru: Кошелёк ещё синхронизируется.

source: The order book is not available yet.
ru: Рынок пока недоступен.

source: Joining
ru: Подключаемся к

source: Opening an account with
ru: Открываем счёт у

source: Test network
ru: Тестовая сеть

source: Earlier records
ru: Более ранние записи

source: Latest records
ru: Последние операции

source: No matching activity on this page.
ru: На этой странице пока нет операций.

source: View activity
ru: История операций

source: No activity on this page.
ru: На этой странице нет операций.

source: Newer records
ru: Более новые записи

source: Try again
ru: Повторить

source: History is unavailable.
ru: История недоступна.

source: Enter a valid amount using your iPhone’s decimal separator.
ru: Введите сумму с десятичным разделителем вашего iPhone.

source: Set an iPhone passcode to protect your wallet.
ru: Установите код-пароль iPhone для защиты кошелька.

source: Wallet locked
ru: Кошелёк заблокирован

source: Swaps
ru: Обмены

source: Status
ru: Статус

source: Requested
ru: Заявлено

source: Gave
ru: Отдано

source: Fee
ru: Комиссия

source: Closed
ru: Закрыт

source: Open
ru: Открыт

source: Cancellation requested
ru: Запрошена отмена

source: Not recorded
ru: Нет данных

source: No execution recorded.
ru: Исполнение не зафиксировано.

source: No orders on this account.
ru: На этом счёте пока нет заявок.

source: below-minTradeSize
ru: Сумма ниже минимального размера сделки.

source: Received before fee
ru: Получено до комиссии

source: Open your wallet to recover confirmed activity.
ru: Откройте кошелёк для восстановления подтверждённых операций.

source: Your wallet was interrupted. Reopen it to recover confirmed activity.
ru: Работа кошелька прервалась. Откройте его снова для восстановления подтверждённых операций.

source: Encrypted backup
ru: Зашифрованная копия

source: Create one encrypted copy of your confirmed wallet state. Your keys stay on this iPhone.
ru: Создайте зашифрованную копию подтверждённого состояния кошелька. Ключи останутся на этом iPhone.

source: Recovery service
ru: Сервис восстановления

source: Allow sending an encrypted copy
ru: Разрешить отправку зашифрованной копии

source: Create and verify backup
ru: Создать и проверить копию

source: Verify saved copy
ru: Проверить сохранённую копию

source: Checking encrypted backup…
ru: Проверяем зашифрованную копию…

source: Verified copy
ru: Проверенная копия

source: Downloaded and verified on this iPhone
ru: Скачана и проверена на этом iPhone

source: Snapshot height
ru: Кадр резервной копии

source: Encrypted size
ru: Размер зашифрованной копии

source: Backup
ru: Резервная копия

source: Enter a recovery service address.
ru: Введите адрес сервиса восстановления.

source: Enter a valid HTTPS recovery address.
ru: Введите правильный HTTPS-адрес сервиса восстановления.

source: Allow sending an encrypted copy first.
ru: Сначала разрешите отправку зашифрованной копии.

source: The recovery service did not confirm storage.
ru: Сервис не подтвердил сохранение копии.

source: Unlock your wallet first.
ru: Сначала откройте кошелёк.

source: Open BrainVault
ru: Открыть BrainVault

source: Open saved device wallet
ru: Кошелёк, сохранённый на iPhone

source: Your name and password recover your BrainVault.
ru: Ваше имя и пароль восстанавливают BrainVault.

source: Use the same details and work settings as before. Your password stays on this device.
ru: Введите прежние данные и параметры вычисления. Пароль остаётся на этом устройстве.

source: Your BrainVault
ru: Ваш BrainVault

source: Name
ru: Имя

source: Password
ru: Пароль

source: Original work settings
ru: Прежние параметры вычисления

source: Work factor
ru: Уровень вычисления

source: 1 · Test
ru: 1 · Тестовый

source: 2 · Basic
ru: 2 · Базовый

source: 3 · Standard
ru: 3 · Стандартный

source: 4 · Strong
ru: 4 · Усиленный

source: 5 · Maximum
ru: 5 · Максимальный

source: Custom shards (optional)
ru: Своё число шардов (необязательно)

source: On a new iPhone, your confirmed accounts must be recovered and verified before the wallet opens.
ru: На новом iPhone перед открытием кошелька нужно восстановить и проверить подтверждённое состояние счетов.

source: Deriving your BrainVault on this iPhone…
ru: Вычисляем BrainVault на этом iPhone…

source: Opening your saved BrainVault…
ru: Открываем сохранённый BrainVault…

source: Finding and verifying your encrypted backup…
ru: Находим и проверяем зашифрованную копию…

# BRAINVAULT_ABORTED
source: BrainVault sign-in was cancelled.
ru: Вход в BrainVault отменён.

source: Enter your BrainVault name and password.
ru: Введите имя и пароль BrainVault.

source: Select your original BrainVault work settings.
ru: Выберите прежние параметры вычисления BrainVault.

source: No verified account backup was found. Check your BrainVault name, password and work settings.
ru: Проверенная копия счетов не найдена. Проверьте имя, пароль и параметры вычисления BrainVault.

source: Cancel
ru: Отмена

source: Encrypted copy: %@. Service limit: %@. No copy was uploaded.
ru: Зашифрованная копия: %@. Лимит сервиса: %@. Копия не отправлена.

source: The recovery service did not report a valid storage limit.
ru: Сервис восстановления не сообщил допустимый размер копии.

source: Market
ru: Рынок

source: Order book and limit orders
ru: Стакан и лимитные ордера

source: Live market
ru: В реальном времени

source: Updating market…
ru: Обновление рынка…

source: Choose a price, then enter your amount. You review the final terms before placing an order.
ru: Выберите цену и укажите объём. Перед размещением ордера вы проверите итоговые условия.

source: Bids
ru: Покупатели

source: Asks
ru: Продавцы

source: Tap to buy WETH
ru: Нажмите, чтобы купить WETH

source: Tap to sell WETH
ru: Нажмите, чтобы продать WETH

source: No orders
ru: Нет ордеров

source: Buy WETH
ru: Купить WETH

source: Sell WETH
ru: Продать WETH

source: Includes your order
ru: Включает ваш ордер

source: Spread
ru: Спред

source: Prices in USDC · amounts in WETH. A limit order may remain open or fill in parts.
ru: Цена в USDC · объём в WETH. Лимитный ордер может оставаться открытым или исполняться частями.

source: Waiting for the market
ru: Ожидаем данные рынка

source: Connect to xln to see live bids and asks.
ru: Подключитесь к xln, чтобы увидеть заявки покупателей и продавцов.

source: Limit price · per WETH
ru: Лимитная цена · за WETH

source: Amount · WETH
ru: Объём · WETH

source: Limit price · USDC per WETH
ru: Лимитная цена · USDC за WETH

source: Price
ru: Цена

source: Your limit sets the price. The order may remain open or fill in parts.
ru: Вы задаёте лимитную цену. Ордер может оставаться открытым или исполняться частями.

source: Choose buy or sell.
ru: Выберите покупку или продажу.

source: Amount and price must be greater than zero.
ru: Объём и цена должны быть больше нуля.

source: Market changed. Reopen the order book.
ru: Рынок изменился. Откройте стакан заново.

source: Payment route
ru: Маршрут платежа

source: Order submitted. Execution is not confirmed yet.
ru: Ордер отправлен. Исполнение ещё не подтверждено.

source: View order result
ru: Посмотреть результат ордера

source: The order account is unavailable. Check Activity.
ru: Счёт ордера недоступен. Проверьте историю.

source: Order status
ru: Состояние ордера

source: Refresh order status
ru: Обновить состояние ордера

source: The order is not in these confirmed records yet.
ru: Ордера пока нет среди этих подтверждённых записей.

source: The recovery service is unavailable. Try again shortly.
ru: Сервис восстановления недоступен. Повторите попытку чуть позже.

source: The backup could not be verified. No recovery data was applied.
ru: Не удалось проверить копию. Данные восстановления не применены.

source: Your BrainVault name
ru: Имя в BrainVault

source: Your password
ru: Ваш пароль

source: Recovery settings
ru: Параметры восстановления

source: Your password stays on this iPhone.
ru: Пароль остаётся на этом iPhone.

source: Use the same work settings as when you created your BrainVault.
ru: Укажите параметры вычисления, с которыми вы создали BrainVault.

source: Enter at least 6 shards.
ru: Введите не менее 6 шардов.

source: Show password
ru: Показать пароль

source: Hide password
ru: Скрыть пароль

source: Unlock your wallet
ru: Открыть кошелёк

source: Your name and private secret recreate the same wallet. No backup phrase is required.
ru: Имя и секретный пароль воссоздают ваш кошелёк. Сид-фраза не нужна.

source: Finishing wallet setup. Keep xln open.
ru: Завершаем открытие кошелька. Не закрывайте xln.

source: Cannot read recovery cancellation status.
ru: Не удалось проверить, отменено ли восстановление.

source: Refresh quote
ru: Обновить котировку

source: Create BrainVault
ru: Создать BrainVault

source: Create your wallet
ru: Создайте кошелёк

source: Confirm password
ru: Подтвердите пароль

source: Repeat your password
ru: Повторите пароль

source: Creating saves an encrypted recovery copy with xln. Remember your name, password and work settings.
ru: При создании xln сохраняет зашифрованную копию для восстановления. Запомните имя, пароль и настройки вычислений.

source: Passwords do not match.
ru: Пароли не совпадают.

source: This BrainVault already exists. Choose Open BrainVault.
ru: Этот BrainVault уже существует. Выберите «Открыть BrainVault».

source: Unknown BrainVault action.
ru: Неизвестное действие BrainVault.

source: Creating your BrainVault…
ru: Создаём ваш BrainVault…

source: Verifying your encrypted recovery copy…
ru: Проверяем зашифрованную копию для восстановления…

source: Waiting for the market minimum.
ru: Ожидаем минимальную сумму рынка.

source: Scan to pay
ru: Сканировать для оплаты

source: Scan QR code
ru: Сканировать QR-код

source: Clear payment request
ru: Удалить платёжный запрос

source: Read payment request
ru: Прочитать платёжный запрос

source: xln address or payment link
ru: Адрес xln или ссылка на оплату

source: Camera unavailable
ru: Камера недоступна

source: Open Settings
ru: Открыть настройки

source: QR scanning is unavailable on this device. Paste a payment link instead.
ru: На этом устройстве нельзя сканировать QR-коды. Вставьте ссылку на оплату.

source: Allow camera access in Settings to scan a payment QR code.
ru: Разрешите доступ к камере в настройках, чтобы сканировать QR-код для оплаты.

source: The camera is unavailable. Check camera restrictions in Settings.
ru: Камера недоступна. Проверьте ограничения камеры в настройках.

source: Invalid payment QR code.
ru: Некорректный платёжный QR-код.

source: This invoice belongs to another network.
ru: Этот счёт относится к другой сети.

source: The invoice asset is unavailable in this wallet.
ru: Актив из этого счёта недоступен в кошельке.

source: Payment details changed. Scan the invoice again.
ru: Данные платежа изменились. Отсканируйте счёт заново.

source: Continue
ru: Продолжить

source: Back
ru: Назад

source: Automatic
ru: Автоматически

# FoundationBootstrapped
source: Wallet ready
ru: Кошелёк готов

source: Recorded
ru: Записано

source: Balance asset
ru: Актив баланса

source: Balance
ru: Баланс

source: Payment capacity
ru: Доступно для платежей

source: Capacity includes available credit.
ru: Доступная сумма включает кредит.

source: Earlier history unavailable
ru: Ранняя история недоступна

source: This device does not have all past payment records.
ru: На этом устройстве есть не все записи о прошлых платежах.

source: Manual backup. Create a new copy after payments or swaps.
ru: Резервная копия создаётся вручную. Обновляйте её после платежей или обменов.

source: Use payment link
ru: Использовать платёжную ссылку
